In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [12]:
cleaned = data.dropna()

In [13]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [15]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data[4] = NA

In [17]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [18]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
df = pd.DataFrame(np.random.randn(7,3))

In [21]:
df.iloc[:4,1] = NA

In [22]:
df.iloc[:2,2]=NA

In [23]:
df

          0         1         2
0  0.089399       NaN       NaN
1  0.804607       NaN       NaN
2  0.428932       NaN  0.011920
3 -1.653638       NaN  1.141777
4  0.874637  1.707435  0.569075
5 -1.028886 -0.528711 -1.048493
6 -0.127508  0.426126  0.606362

In [24]:
df.dropna()

          0         1         2
4  0.874637  1.707435  0.569075
5 -1.028886 -0.528711 -1.048493
6 -0.127508  0.426126  0.606362

In [25]:
df.dropna(thresh=2) #각 행에서 2개 이상의 유의미한 열을 남기는 행만 고르는 것

          0         1         2
2  0.428932       NaN  0.011920
3 -1.653638       NaN  1.141777
4  0.874637  1.707435  0.569075
5 -1.028886 -0.528711 -1.048493
6 -0.127508  0.426126  0.606362

In [26]:
df.fillna(0)

          0         1         2
0  0.089399  0.000000  0.000000
1  0.804607  0.000000  0.000000
2  0.428932  0.000000  0.011920
3 -1.653638  0.000000  1.141777
4  0.874637  1.707435  0.569075
5 -1.028886 -0.528711 -1.048493
6 -0.127508  0.426126  0.606362

In [27]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.089399  0.500000  0.000000
1  0.804607  0.500000  0.000000
2  0.428932  0.500000  0.011920
3 -1.653638  0.500000  1.141777
4  0.874637  1.707435  0.569075
5 -1.028886 -0.528711 -1.048493
6 -0.127508  0.426126  0.606362

In [28]:
_ = df.fillna(0, inplace = True)

In [29]:
df

          0         1         2
0  0.089399  0.000000  0.000000
1  0.804607  0.000000  0.000000
2  0.428932  0.000000  0.011920
3 -1.653638  0.000000  1.141777
4  0.874637  1.707435  0.569075
5 -1.028886 -0.528711 -1.048493
6 -0.127508  0.426126  0.606362

In [30]:
df = pd.DataFrame(np.random.randn(6,3))

In [31]:
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA
df

          0         1         2
0 -0.111017 -0.805682 -0.493669
1 -1.197821  1.387131 -0.802610
2 -1.546020       NaN -1.028233
3 -3.276054       NaN  0.946987
4 -0.265232       NaN       NaN
5  0.582662       NaN       NaN

In [32]:
df.fillna(method='ffill')

          0         1         2
0 -0.111017 -0.805682 -0.493669
1 -1.197821  1.387131 -0.802610
2 -1.546020  1.387131 -1.028233
3 -3.276054  1.387131  0.946987
4 -0.265232  1.387131  0.946987
5  0.582662  1.387131  0.946987

In [33]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.111017 -0.805682 -0.493669
1 -1.197821  1.387131 -0.802610
2 -1.546020  1.387131 -1.028233
3 -3.276054  1.387131  0.946987
4 -0.265232       NaN  0.946987
5  0.582662       NaN  0.946987

In [34]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [35]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [36]:
data = pd.DataFrame({'k1':['one','two']*3 + ['two'],
                     'k2':[1,1,2,3,3,4,4]})

In [37]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [38]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [39]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [40]:
data['v1'] = range(7)

In [41]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [42]:
data.drop_duplicates(['k1','k2'],keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [43]:
data=pd.DataFrame({'food': ['bacon','pulled pork','bacon',
                            'Pastrami','corned beef', 'Bacon',
                            'pastrami','honey ham','nova lox'],
                   'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [44]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [45]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [46]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [47]:
data['animal']=lowercased.map(meat_to_animal)

In [48]:
data=pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [49]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [50]:
data.replace([-999, -1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [51]:
data.replace([-999, -1000],[np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [52]:
data.replace({-999 : np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [53]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                    index=['Ohio','Colorado','New York'],
                    columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [54]:
transform = lambda x: x[:4].upper()

In [55]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [56]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [57]:
data.rename(index=str.title,columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [58]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [59]:
data.rename(index={'OHIO': 'INDIANA'},inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [165]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

In [166]:
bins = [18, 25, 35, 60, 100]

In [167]:
cats = pd.cut(ages, bins)

In [168]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [169]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [170]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [171]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [172]:
pd.cut(ages, [18,26,36,61,100], right = False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [173]:
group_names = ['Youth','YoungAdult','MiddleAged','Senior']

In [176]:
pd.cut(ages,bins,labels = group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [177]:
data = np.random.rand(20)

In [178]:
pd.cut(data, 4, precision = 2)

[(0.75, 0.99], (0.75, 0.99], (0.0074, 0.25], (0.0074, 0.25], (0.25, 0.5], ..., (0.5, 0.75], (0.75, 0.99], (0.5, 0.75], (0.75, 0.99], (0.0074, 0.25]]
Length: 20
Categories (4, interval[float64]): [(0.0074, 0.25] < (0.25, 0.5] < (0.5, 0.75] < (0.75, 0.99]]

In [179]:
data = np.random.randn(1000) #정규분포

In [180]:
cats = pd.qcut(data,4) #4분위로 분류
cats

[(0.62, 3.928], (-2.9499999999999997, -0.691], (-0.691, -0.0192], (-0.0192, 0.62], (-0.0192, 0.62], ..., (0.62, 3.928], (-0.691, -0.0192], (-0.691, -0.0192], (-0.691, -0.0192], (-0.691, -0.0192]]
Length: 1000
Categories (4, interval[float64]): [(-2.9499999999999997, -0.691] < (-0.691, -0.0192] < (-0.0192, 0.62] < (0.62, 3.928]]

In [181]:
pd.value_counts(cats)

(0.62, 3.928]                    250
(-0.0192, 0.62]                  250
(-0.691, -0.0192]                250
(-2.9499999999999997, -0.691]    250
dtype: int64

In [182]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])

[(1.289, 3.928], (-1.191, -0.0192], (-1.191, -0.0192], (-0.0192, 1.289], (-0.0192, 1.289], ..., (1.289, 3.928], (-1.191, -0.0192], (-1.191, -0.0192], (-1.191, -0.0192], (-1.191, -0.0192]]
Length: 1000
Categories (4, interval[float64]): [(-2.9499999999999997, -1.191] < (-1.191, -0.0192] < (-0.0192, 1.289] < (1.289, 3.928]]

In [183]:
data = pd.DataFrame(np.random.randn(1000,4))

In [184]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.022282    -0.001383    -0.055245     0.043350
std       1.008995     0.995882     0.998735     0.996658
min      -3.184377    -3.745356    -3.428254    -3.645860
25%      -0.628122    -0.697084    -0.747963    -0.600254
50%      -0.016127    -0.026381    -0.096965     0.043663
75%       0.695298     0.699046     0.622384     0.740562
max       3.525865     2.735527     3.366626     2.653656

In [185]:
col = data[2]

In [186]:
col[np.abs(col) > 3]

267   -3.428254
644    3.366626
Name: 2, dtype: float64

In [187]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
50  -0.025907 -3.399312 -0.974657 -0.685312
69   3.260383  0.963301  1.201206 -1.852001
145 -0.196713 -3.745356 -1.520113 -0.346839
244 -3.056990  1.918403 -0.578828  1.847446
267  0.326045  0.425384 -3.428254 -0.296336
331 -3.184377  1.369891 -1.074833 -0.089937
552  0.208011 -0.150923 -0.362528 -3.548824
644  0.193299  1.397822  3.366626 -2.372214
791  3.525865  0.283070  0.544635  0.462204
811 -0.450721 -0.080332  0.599947 -3.645860

In [188]:
data[(np.abs(data) > 1.2).all(1)]

            0         1         2         3
271  1.554737 -1.595272 -1.260744 -1.466780
313  1.775549 -2.224413  1.394369  1.778817
553  1.553205 -2.186301  1.277104 -1.447885

In [189]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [190]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.021737    -0.000238    -0.055183     0.044545
std       1.005754     0.992064     0.996186     0.992637
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.628122    -0.697084    -0.747963    -0.600254
50%      -0.016127    -0.026381    -0.096965     0.043663
75%       0.695298     0.699046     0.622384     0.740562
max       3.000000     2.735527     3.000000     2.653656

In [191]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0 -1.0
1  1.0  1.0 -1.0 -1.0
2  1.0 -1.0 -1.0 -1.0
3  1.0  1.0 -1.0  1.0
4 -1.0 -1.0 -1.0 -1.0

In [192]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [193]:
sampler = np.random.permutation(5)
sampler

array([4, 3, 2, 1, 0])

In [194]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [195]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3

In [196]:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
1   4   5   6   7

In [197]:
choices = pd.Series([5,7,-1,6,4])

In [198]:
draws = choices.sample(n=10,replace=True)
draws

0    5
1    7
3    6
4    4
0    5
0    5
1    7
0    5
0    5
4    4
dtype: int64

In [199]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'],
                   'data1': range(6)})

In [200]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [201]:
dummies = pd.get_dummies(df['key'],prefix='key')

In [202]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [203]:
mnames = ['movie_id','title','genres']

In [237]:
movies = pd.read_csv('movies.csv',sep=',',
                       header=0, names=mnames)

In [238]:
movies[:10]

,movie_id,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
5,6,Heat (1995),Action|Crime|Thriller
6,7,Sabrina (1995),Comedy|Romance
7,8,Tom and Huck (1995),Adventure|Children
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller

In [227]:
all_genres = []

In [228]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [229]:
genres = pd.unique(all_genres)
genres

array(['Adventure', 'Animation', 'Children', 'Comedy', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Mystery', 'Sci-Fi', 'War', 'Musical', 'Documentary', 'IMAX',
       'Western', 'Film-Noir', '(no genres listed)'], dtype=object)

In [230]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [231]:
dummies = pd.DataFrame(zero_matrix, columns = genres)

In [232]:
gen = movies.genres[0]

In [291]:
gen.split('|')

['genres']

In [292]:
dummies.columns.get_indexer(gen.split('|'))

array([-1], dtype=int64)

In [312]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [313]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [331]:
movies_windic.iloc[0]

movie_id                                                              1
title                                                  Toy Story (1995)
genres                      Adventure|Animation|Children|Comedy|Fantasy
Genre_Adventure                                                       1
Genre_Animation                                                       1
Genre_Children                                                        1
Genre_Comedy                                                          1
Genre_Fantasy                                                         1
Genre_Romance                                                         0
Genre_Drama                                                           0
Genre_Action                                                          0
Genre_Crime                                                           0
Genre_Thriller                                                        0
Genre_Horror                                                          0
Genre_Mystery                                                         0
Genre_Sci-Fi                                                          0
Genre_War                                                             0
Genre_Musical                                                         0
Genre_Documentary                                                     0
Genre_IMAX                                                            0
Genre_Western                                                         0
Genre_Film-Noir                                                       0
Genre_(no genres listed)                                              0
Name: 0, dtype: object

In [283]:
np.random.seed(12345)

In [269]:
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [244]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [245]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [246]:
val = 'a,b,   guido'

In [247]:
val.split(',')

['a', 'b', '   guido']

In [251]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [252]:
first, second, third = pieces

In [253]:
first + '::' + second + '::' + third

'a::b::guido'

In [254]:
'::'.join(pieces)

'a::b::guido'

In [255]:
'guido' in val

True

In [256]:
val.index(',')

1

In [257]:
val.find(':')

-1

In [259]:
val.index(':') # error 발생

ValueError: substring not found

In [260]:
val.count(',')

2

In [122]:
val.replace(',','::')

'a::b::   guido'

In [123]:
val.replace(',', '')

'ab   guido'

In [124]:
# count  endswith   startswith   join   index   find     rfind   replace   strip   rstrip  lstrip
# lower   upper     casefold      ljust

In [125]:
import re

In [126]:
text = "foo bar\t baz \tqux"

In [127]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [128]:
regex = re.compile('\s+')

In [129]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [130]:
regex.findall(text)

[' ', '\t ', ' \t']

In [131]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [132]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [133]:
regex = re.compile(pattern, flags = re.IGNORECASE)

In [134]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [135]:
m = regex.search(text)
m

In [136]:
text[m.start():m.end()]

'dave@google.com'

In [137]:
print(regex.match(text))

None

In [138]:
print(regex.sub('REDACTED',text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [139]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [140]:
regex = re.compile(pattern, flags = re.IGNORECASE)

In [141]:
m = regex.match('wesm@bright.net')

In [142]:
m.group

In [143]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [144]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [145]:
# findall   finditer    match     search       split       sub      subn

In [146]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [147]:
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [148]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [149]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [150]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [151]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [152]:
matches = data.str.findall(pattern, flags=re.IGNORECASE)
matches

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [153]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [154]:
matches.str[0]

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [155]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

벡터화한 문자열 메서드
cat   contains    count    extract     endswith     startswith      findall    get   isalnum    isalpha
isdecimal     isdigit     islower      isnumeric     isupper      join    len    lower     upper
match      pad     center     repeat     replace     slice